Revit 2027 API
ParameterTypeId.BoundaryXRotationSpring Property
 "X Rotation - Spring"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryXRotationSpring { get; }
Public Shared ReadOnly Property BoundaryXRotationSpring As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryXRotationSpring {
	ForgeTypeId^ get ();
}
static member BoundaryXRotationSpring : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace